app/views/posts/new.html.erb

    <p class = "text-success">Категория<br>
    <%= f.select :category_id, options_from_collection_for_select(Category.all, "id", "name"), {}, class: 'form-control' %>
---
SELECT "categories".* FROM "categories"