app/controllers/autocompletes_controller.rb

SELECT  "posts".* FROM "posts" WHERE (title like '%de%') LIMIT ?  [["LIMIT", 11]]
SELECT "posts".* FROM "posts" WHERE (UPPER(title) like UPPER('%dj%'))
---
  def posts
    term = params[:term]
    posts = Post.where("UPPER(title) like UPPER(?)", "%#{term}%")
    render  json: posts.map {|post| {value: post.id, label: post.title}}