app/controllers/posts_controller.rb

SELECT COUNT(*) FROM "posts" WHERE (UPPER(title) like UPPER('%%'))
---
  def index
      #debugger
      term = params[:post_name]
      #@posts = Post.all.paginate(page: params[:page], per_page: 3)
      @posts = Post.where("UPPER(title) like UPPER(?)", "%#{term}%").paginate(page: params[:page], per_page: 10)

INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?)  [["title", "РПЦ"], ["body", "вот такие дела"], ["created_at", "2018-10-17 20:25:37.294635"], ["updated_at", "2018-10-17 20:25:37.294635"], ["category_id", 4]]
---
  def create
    #render plain: params[:post].inspect
    @post = Post.new(post_params)
    #save post
    @post.save